import aiogram
import os

CONTACTS_COMMAND = """
<b>❗ Команда нашего Minecraft сервера всегда рада видеть новых игроков в нашем сообществе!</b>

<b>👀 Если у вас есть какие-либо вопросы, вы можете обратиться к нашей команде поддержки</b>

<b>💻 Ниже вы можете найти список контактов наших администраторов, которые готовы помочь вам в любое время</b>

<b><a href="https://t.me/andriykaaaaa">Тех.администратор</a> 🛠 Андрей</b>
<b><a href="https://t.me/auditoreold">Главный разработчик</a> 🛠 Никита</b>
<b><a href="https://t.me/morkovka2005">Главный разработчик</a> 🛠 Денис</b>
<b><a href="https://t.me/somedieyoung69">Рекламный агент</a> 📷 Владислав</b>
<b><a href="https://t.me/RymunVodila">Куратор проекта</a> ✉️ Дмитрий</b>


<b>Благодарим вас за выбор <u>Stonehaven RP!</u> ❤️</b>
"""
MEDIA_COMMAND = """
<b>💬 Присоединяйтесь к нашему сообществу, чтобы получать новости о сервере и участвовать в мероприятиях</b>

<b>🔗 Ниже вы можете найти ссылки на наш сайт, YouTube-канал и Telegram-группу:</b>

- <b><a href="https://t.me/stonehavenrp">Telegram</a> ☎️</b>
- <b><a href="https://www.youtube.com/channel/UC4wTrC4WZ8oByLpkojBd3KA">YouTube</a> 🎥</b>
- <b><a href="https://stonehavenrp.com/">Сайт</a> ✉️</b>

<b>🤩 Подписывайтесь на нас, чтобы быть в курсе последних новостей и мероприятий на сервере!</b>

<b><em>🔥 Крутые события, интересные конкурсы, призы и многое другое ждут вас! 🔥</em></b>
"""

TOKEN_API = "6064195503:AAHL9SrKGWqdynJUqqIn04o9dJF8p4-nWVM"
DB_HOST = "localhost"
DB_USER = "root"
DB_NAME = "stonehaven_database"
DB_PASSWORD = "root1234"
sender_email = "stonehaven.reset@gmail.com"
app_password = "lfemarbsgejrcfmq"